/*
 *  면접
 *  ---
 *  함수 vs 메소드
 *  ----------- 한 가지 기능을 수행
 *  
 *  함수 : 독립적으로 사용
 *  메소드 : 클래스 안에서만 사용 (클래스 종속)
 *  ---------------------------- 종료하는 시점 ==> return;(자동 추가 / (void안에서)생략 가능)
 *  배열/메소드
 *  --------클래스
 *  		----- 객체지향에 맞게
 *  				데이터 보호 (캡슐화)
 *  				재사용 (상속,포함)
 *  				      is-a  has-a
 *  				수정,추가
 *  			**** 오버로딩 (new) , 오버라이딩 (modify)
 *  			==> 유지보수가 쉽게 제작
 *  			
 *  
 *  
 *  
 */
public class 반복제어문_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		return; // 자동 추가 (컴파일러)
	}

}
