/*
 * 1.데이터 저장
 * 	젼수 : 한개만 저장 (메모리 공강)
 * => 변수 : 프로그램에 따라 변경이 가능
 * => 상수 : 고정 (fianl)
 * 2. 저장 방법 : 메모리 크기 (기본형 , 데이터형)
 * 정수 
 *  1byte(-128-127) => byte
 *  	=> 네트워크(송수신) , 파일업로드 ,다운로드, Web
 *  int : default => 모든 컴퓨터는 모든 숫자를 int 로 인식
 *  --- 4byte(32bit)
 *  long: 64bit(큰 숫자를 저장) : 금융권 ...
 *  ---
 *  -------------- 정수
 *  정수 저장 => 10
 *  int 메모리 공간
 *  	-------- =10
 *         {} 종료시 , 프로그램 종료 => 사라진다
 *  실수
 *   double : 64bit => 15자리 소수점 저자이 가능
 *  문자
 *   char(0~65535) => 각 문자마다 고유번호를 가지고 있따.
 *   컴퓨터는무조건  => 0,1(2진법)
 *   =>'A' = 65
 *   =>'a' = 97
 *   =>'0' = 48
 *  논리 : 1byte==> boolean
 *  	  => 저장할 수 있는 값 : true , false
 *  -------------------------------------
 *  데이터 가공
 *  --------- 점수입력 (국어,영어,수학) => 평균 ,총점,등수
 *                                  -----------
 *                                  
 *  Web => 조회수 증가 , 인기 순위 (데이터 가공)
 *  	  hit=hit+1;   sort
 *  	=>연산자 
 */
package 자바1주차_정리;

public class 자바정리_특징 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
